// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое
int max = 0;
int min = 0;

Console.WriteLine("Введите первое число: ");
int num1 = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите второе число: ");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1 > num2);

System.Console.WriteLine(«Большее число: » + a + «, меньшее число: » + b);

else System.Console.WriteLine($»Большее число: {a}, меньшее число: {b}»);